app/controllers/users_controller.rb

  def create
    @account = Account.find_by_name(params[:account_name])
    @user = @account.users.build(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `updated_at`, `username`, `password`, `email`) VALUES('2010-08-19 16:28:26', '2010-08-19 16:28:26', 'fred', 'fred', NULL)